In [2]:
import pandas as pd

df = pd.read_csv("cafe4.csv")
df

      메뉴    가격  칼로리    원산지    이벤트가
0  아메리카노  4500   10   콜롬비아     NaN
1   카페라떼  5000  110  코스타리카  1000.0
2   카페모카  5500  250   과테말라  1000.0
3   카푸치노  5000  110   과테말라     NaN
4  에스프레소  4000   20   과테말라     NaN
5    밀크티  5900  210   과테말라     NaN
6     녹차  5300    0   대한민국     NaN
7   구미라떼  2000   20  코스타리카     NaN

In [3]:
# len() 
len(df)

8

In [4]:
# sum()
cond = df["가격"] > 5000
sum(cond)

cond.sum()

np.int64(3)

In [5]:
df.sum(numeric_only=True)

가격      37200.0
칼로리       730.0
이벤트가     2000.0
dtype: float64

In [6]:
df

      메뉴    가격  칼로리    원산지    이벤트가
0  아메리카노  4500   10   콜롬비아     NaN
1   카페라떼  5000  110  코스타리카  1000.0
2   카페모카  5500  250   과테말라  1000.0
3   카푸치노  5000  110   과테말라     NaN
4  에스프레소  4000   20   과테말라     NaN
5    밀크티  5900  210   과테말라     NaN
6     녹차  5300    0   대한민국     NaN
7   구미라떼  2000   20  코스타리카     NaN

In [7]:
# transpose 

df.T

          0       1       2     3      4     5     6      7
메뉴    아메리카노    카페라떼    카페모카  카푸치노  에스프레소   밀크티    녹차   구미라떼
가격     4500    5000    5500  5000   4000  5900  5300   2000
칼로리      10     110     250   110     20   210     0     20
원산지    콜롬비아   코스타리카    과테말라  과테말라   과테말라  과테말라  대한민국  코스타리카
이벤트가    NaN  1000.0  1000.0   NaN    NaN   NaN   NaN    NaN

In [8]:
# max(), min(), mean(), median(), sum(), std(), var()

df

      메뉴    가격  칼로리    원산지    이벤트가
0  아메리카노  4500   10   콜롬비아     NaN
1   카페라떼  5000  110  코스타리카  1000.0
2   카페모카  5500  250   과테말라  1000.0
3   카푸치노  5000  110   과테말라     NaN
4  에스프레소  4000   20   과테말라     NaN
5    밀크티  5900  210   과테말라     NaN
6     녹차  5300    0   대한민국     NaN
7   구미라떼  2000   20  코스타리카     NaN

In [9]:
print("최대값", df["가격"].max())
print("최소값", df["가격"].min())
print("평균",   df["가격"].mean())
print("중앙값", df["가격"].median())
print("합계",   df["가격"].sum())
print("표준편차", df["가격"].std())
print("분산",   df["가격"].var())

최대값 5900
최소값 2000
평균 4650.0
중앙값 5000.0
합계 37200
표준편차 1220.070255588353
분산 1488571.4285714286

In [10]:
# 백분위수 quantile()

print("분위수 25% 값", df["가격"].quantile(0.25))
print("분위수 75% 값", df["가격"].quantile(0.75))

분위수 25% 값 4375.0
분위수 75% 값 5350.0

In [11]:
# 최빈값 mode()
df["원산지"].mode()

0    과테말라
Name: 원산지, dtype: object

In [12]:
df.describe()

                가격         칼로리    이벤트가
count     8.000000    8.000000     2.0
mean   4650.000000   91.250000  1000.0
std    1220.070256   96.427249     0.0
min    2000.000000    0.000000  1000.0
25%    4375.000000   17.500000  1000.0
50%    5000.000000   65.000000  1000.0
75%    5350.000000  135.000000  1000.0
max    5900.000000  250.000000  1000.0

In [13]:
# idxmax(), idxmin() 
# 데이터프레임에서 최대값을 가지고 있는 index를 구할때 
# 데이터프레임에서 최소값을 가지고 있는 index를 구할때 

print(df["가격"].idxmax())
print(df["가격"].idxmin())

5
7

In [14]:
df

      메뉴    가격  칼로리    원산지    이벤트가
0  아메리카노  4500   10   콜롬비아     NaN
1   카페라떼  5000  110  코스타리카  1000.0
2   카페모카  5500  250   과테말라  1000.0
3   카푸치노  5000  110   과테말라     NaN
4  에스프레소  4000   20   과테말라     NaN
5    밀크티  5900  210   과테말라     NaN
6     녹차  5300    0   대한민국     NaN
7   구미라떼  2000   20  코스타리카     NaN

In [18]:
# nlargest(), nsmallest()
# 데이터프레임에서 특정 컬럼에서 가장 큰 값 
# 또는 가장 작은 값을 반환할때

df.nlargest(1, "가격")

    메뉴    가격  칼로리   원산지  이벤트가
5  밀크티  5900  210  과테말라   NaN

In [16]:
temp =df.nlargest(n=3, columns="가격")
print(temp)
temp.iloc[2, 3]
temp.loc[6, "원산지"]

     메뉴    가격  칼로리   원산지    이벤트가
5   밀크티  5900  210  과테말라     NaN
2  카페모카  5500  250  과테말라  1000.0
6    녹차  5300    0  대한민국     NaN

'대한민국'